Pandas incorporates two additional data structures into Python, namely Pandas Series and Pandas DataFrame.

- How to import Pandas
- How to create Pandas Series and DataFrames using various methods
- How to access and change elements in Series and DataFrames
- How to perform arithmetic operations on Series
- How to load data into a DataFrame
- How to deal with Not a Number (NaN) values

[Pandas Documentation](https://pandas.pydata.org/pandas-docs/stable/)

Pandas Series and DataFrames are designed for fast data analysis and manipulation, as well as being flexible and easy to use. Below are just a few features that makes Pandas an excellent package for data analysis:

- Allows the use of labels for rows and columns
- Can calculate rolling statistics on time series data
- Easy handling of NaN values
- Is able to load data of different formats into DataFrames
- Can join and merge different datasets together
- It integrates with NumPy and Matplotlib

In [1]:
import pandas as pd

groceries = pd.Series(data=[20,6,'Yes','No'], index=['eggs', 'apples', 'milk', 'bread'])
print(groceries)

eggs       20
apples      6
milk      Yes
bread      No
dtype: object

In [2]:
print("\nShape:", groceries.shape)
print("Number of dimentions:", groceries.ndim)
print("Size:", groceries.size)

Shape: (4,)
Number of dimentions: 1
Size: 4

In [4]:
print(groceries.index)
print(groceries.values)

Index(['eggs', 'apples', 'milk', 'bread'], dtype='object')
[20 6 'Yes' 'No']

In [6]:
'banana' in groceries

False

In [7]:
'bread' in groceries

True

# Accessing and Deleting Elements in Pandas Series

In [8]:
groceries['eggs']

20

In [10]:
groceries[['eggs','milk']]

eggs     20
milk    Yes
dtype: object

In [11]:
groceries[0]  # first element

20

In [12]:
groceries[-1]  # last element

'No'

In [14]:
groceries[[0,-1]]

eggs     20
bread    No
dtype: object

In [15]:
groceries.loc['eggs']  # explicity using a labeled index

20

In [16]:
groceries.iloc[2]  # explicity using a numeric index

'Yes'

In [19]:
groceries['eggs'] = 2
groceries

eggs        2
apples      6
milk      Yes
bread      No
dtype: object

In [21]:
groceries.drop('apples') # returns groceries without apples

eggs       2
milk     Yes
bread     No
dtype: object

In [22]:
groceries # apples still in groceries

eggs        2
apples      6
milk      Yes
bread      No
dtype: object

In [23]:
groceries.drop('apples', inplace=True)
groceries

eggs       2
milk     Yes
bread     No
dtype: object

In [25]:
fruits = pd.Series([10, 6, 3], ['apples','oranges','bananas'])
fruits

apples     10
oranges     6
bananas     3
dtype: int64

In [26]:
fruits + 2

apples     12
oranges     8
bananas     5
dtype: int64

In [27]:
fruits * 2

apples     20
oranges    12
bananas     6
dtype: int64

In [28]:
import numpy as np

In [29]:
np.sqrt(fruits)

apples     3.162278
oranges    2.449490
bananas    1.732051
dtype: float64

In [30]:
np.exp(fruits)

apples     22026.465795
oranges      403.428793
bananas       20.085537
dtype: float64

In [31]:
np.power(fruits, 2)

apples     100
oranges     36
bananas      9
dtype: int64

In [32]:
fruits

apples     10
oranges     6
bananas     3
dtype: int64

In [34]:
fruits['bananas'] + 2

5

In [35]:
fruits.iloc[0] + 1

11

In [36]:
# double apples and oranges
fruits[['apples', 'oranges']] * 2

apples     20
oranges    12
dtype: int64

In [48]:
import pandas as pd

# Create a Pandas Series that contains the distance of some planets from the Sun.
# Use the name of the planets as the index to your Pandas Series, and the distance
# from the Sun as your data. The distance from the Sun is in units of 10^6 km

distance_from_sun = [149.6, 1433.5, 227.9, 108.2, 778.6]

planets = ['Earth','Saturn', 'Mars','Venus', 'Jupiter']

# Create a Pandas Series using the above data, with the name of the planets as
# the index and the distance from the Sun as your data.
dist_planets = pd.Series(index=planets, data=distance_from_sun)

print(dist_planets)

Earth       149.6
Saturn     1433.5
Mars        227.9
Venus       108.2
Jupiter     778.6
dtype: float64

In [49]:
# Calculate the number of minutes it takes sunlight to reach each planet. You can
# do this by dividing the distance from the Sun for each planet by the speed of light.
# Since in the data above the distance from the Sun is in units of 10^6 km, you can
# use a value for the speed of light of c = 18, since light travels 18 x 10^6 km/minute.
time_light = dist_planets / 18

print(time_light)

Earth       8.311111
Saturn     79.638889
Mars       12.661111
Venus       6.011111
Jupiter    43.255556
dtype: float64

In [50]:
close_planets = time_light[(time_light < 40)]

In [51]:
print(close_planets)

Earth     8.311111
Mars     12.661111
Venus     6.011111
dtype: float64

## Creating Pandas DataFrames

In [52]:
import pandas as pd

In [53]:
# dataframe is like a powerfull spreadsheet

items = {'Bob' : pd.Series(data = [245, 25, 55], index = ['bike', 'pants', 'watch']),
         'Alice' : pd.Series(data = [40, 110, 500, 45], index = ['book', 'glasses', 'bike', 'pants'])}

# We print the type of items to see that it is a dictionary
print(type(items))

<class 'dict'>

In [54]:
shopping_carts = pd.DataFrame(items)
shopping_carts

           Bob  Alice
bike     245.0  500.0
book       NaN   40.0
glasses    NaN  110.0
pants     25.0   45.0
watch     55.0    NaN

In [55]:
shopping_carts.shape

(5, 2)

In [56]:
shopping_carts.ndim

2

In [61]:
shopping_carts.values

array([[ 245.,  500.],
       [  nan,   40.],
       [  nan,  110.],
       [  25.,   45.],
       [  55.,   nan]])

In [62]:
# We create a list of Python dictionaries
items2 = [{'bikes': 20, 'pants': 30, 'watches': 35}, 
          {'watches': 10, 'glasses': 50, 'bikes': 15, 'pants':5}]

# We create a DataFrame 
store_items = pd.DataFrame(items2)

# We display the DataFrame
store_items

   bikes  glasses  pants  watches
0     20      NaN     30       35
1     15     50.0      5       10

## Accessing Elements in Pandas DataFrames

In [88]:
# We create a list of Python dictionaries
items2 = [{'bikes': 20, 'pants': 30, 'watches': 35}, 
          {'watches': 10, 'glasses': 50, 'bikes': 15, 'pants':5}]

# We create a DataFrame 
store_items = pd.DataFrame(items2, index=['store 1', 'store 2'])

# We display the DataFrame
store_items

         bikes  glasses  pants  watches
store 1     20      NaN     30       35
store 2     15     50.0      5       10

In [89]:
# access column labels first
store_items['bikes']['store 1']

20

In [90]:
store_items['shirts'] = [15, 2]
store_items

         bikes  glasses  pants  watches  shirts
store 1     20      NaN     30       35      15
store 2     15     50.0      5       10       2

In [91]:
store_items['suits'] = store_items['shirts'] + store_items['pants']
store_items

         bikes  glasses  pants  watches  shirts  suits
store 1     20      NaN     30       35      15     45
store 2     15     50.0      5       10       2      7

In [92]:
new_items = [{'pants': 30}]
new_store = pd.DataFrame(new_items, index=['store 3'])
new_store

         pants
store 3     30

In [93]:
store_items = store_items.append(new_store, sort=True)
store_items

         bikes  glasses  pants  shirts  suits  watches
store 1   20.0      NaN     30    15.0   45.0     35.0
store 2   15.0     50.0      5     2.0    7.0     10.0
store 3    NaN      NaN     30     NaN    NaN      NaN

In [94]:
# delete a column with pop
store_items.pop('glasses')
store_items

         bikes  pants  shirts  suits  watches
store 1   20.0     30    15.0   45.0     35.0
store 2   15.0      5     2.0    7.0     10.0
store 3    NaN     30     NaN    NaN      NaN

In [95]:
# delete by axis
store_items = store_items.drop(['bikes'], axis=1)  # bikes column
store_items

         pants  shirts  suits  watches
store 1     30    15.0   45.0     35.0
store 2      5     2.0    7.0     10.0
store 3     30     NaN    NaN      NaN

In [96]:
# delete by row label
store_items = store_items.drop(['store 1'], axis=0)
store_items

         pants  shirts  suits  watches
store 2      5     2.0    7.0     10.0
store 3     30     NaN    NaN      NaN

In [98]:
store_items = store_items.rename(columns={'pants': 'hats'})

In [99]:
store_items

         hats  shirts  suits  watches
store 2     5     2.0    7.0     10.0
store 3    30     NaN    NaN      NaN

In [100]:
store_items = store_items.rename(index={'store 3': 'fun'})
store_items

         hats  shirts  suits  watches
store 2     5     2.0    7.0     10.0
fun        30     NaN    NaN      NaN

In [102]:
# Dealing with NaN
x = store_items.isnull()
print(x)

          hats  shirts  suits  watches
store 2  False   False  False    False
fun      False    True   True     True

In [104]:
# numer of NaNs is sum of logical true
x = store_items.isnull().sum()
print(x)

hats       0
shirts     1
suits      1
watches    1
dtype: int64

In [105]:
# sum the results
x = store_items.isnull().sum().sum()
print(x)

3

In [106]:
store_items.count()

hats       2
shirts     1
suits      1
watches    1
dtype: int64

In [107]:
# return a frame eliminating rows with NaN values
store_items.dropna(axis=0) # or store_items.dropna(axis=0, inplace=True)

         hats  shirts  suits  watches
store 2     5     2.0    7.0     10.0

In [108]:
store_items

         hats  shirts  suits  watches
store 2     5     2.0    7.0     10.0
fun        30     NaN    NaN      NaN

In [109]:
# return a frame eliminating columns with NaN values
store_items.dropna(axis=1) # or store_items.dropna(axis=1, inplace=True)

         hats
store 2     5
fun        30

In [110]:
# replace NaNs with 0
store_items.fillna(0)

         hats  shirts  suits  watches
store 2     5     2.0    7.0     10.0
fun        30     0.0    0.0      0.0

In [113]:
# forward fill
store_items.fillna(method='ffill', axis=0)

         hats  shirts  suits  watches
store 2     5     2.0    7.0     10.0
fun        30     2.0    7.0     10.0

In [114]:
store_items

         hats  shirts  suits  watches
store 2     5     2.0    7.0     10.0
fun        30     NaN    NaN      NaN

In [115]:
# backward fill
store_items.fillna(method='backfill', axis=0)

         hats  shirts  suits  watches
store 2     5     2.0    7.0     10.0
fun        30     NaN    NaN      NaN

In [117]:
store_items.fillna(method='ffill', axis=1)

         hats  shirts  suits  watches
store 2   5.0     2.0    7.0     10.0
fun      30.0    30.0   30.0     30.0

In [130]:
import pandas as pd
import numpy as np

# Since we will be working with ratings, we will set the precision of our 
# dataframes to one decimal place.
pd.set_option('precision', 1)

# Create a Pandas DataFrame that contains the ratings some users have given to a
# series of books. The ratings given are in the range from 1 to 5, with 5 being
# the best score. The names of the books, the authors, and the ratings of each user
# are given below:

books = pd.Series(data = ['Great Expectations', 'Of Mice and Men', 'Romeo and Juliet', 'The Time Machine', 'Alice in Wonderland' ])
authors = pd.Series(data = ['Charles Dickens', 'John Steinbeck', 'William Shakespeare', ' H. G. Wells', 'Lewis Carroll' ])

user_1 = pd.Series(data = [3.2, np.nan ,2.5])
user_2 = pd.Series(data = [5., 1.3, 4.0, 3.8])
user_3 = pd.Series(data = [2.0, 2.3, np.nan, 4])
user_4 = pd.Series(data = [4, 3.5, 4, 5, 4.2])

# Users that have np.nan values means that the user has not yet rated that book.
# Use the data above to create a Pandas DataFrame that has the following column
# labels: 'Author', 'Book Title', 'User 1', 'User 2', 'User 3', 'User 4'. Let Pandas
# automatically assign numerical row indices to the DataFrame. 

# Create a dictionary with the data given above
dat = {
    'Author': authors, 
    'Book Title': books, 
    'User 1': user_1, 
    'User 2': user_2, 
    'User 3': user_3, 
    'User 4': user_4
}

# Use the dictionary to create a Pandas DataFrame
book_ratings = pd.DataFrame(dat)

# If you created the dictionary correctly you should have a Pandas DataFrame
# that has column labels: 'Author', 'Book Title', 'User 1', 'User 2', 'User 3',
# 'User 4' and row indices 0 through 4.
print(book_ratings)

# Now replace all the NaN values in your DataFrame with the average rating in
# each column. Replace the NaN values in place. HINT: you can use the fillna()
# function with the keyword inplace = True, to do this. Write your code below:
book_ratings['User 1'].fillna(book_ratings['User 1'].mean(), inplace = True)
book_ratings['User 2'].fillna(book_ratings['User 2'].mean(), inplace = True)
book_ratings['User 3'].fillna(book_ratings['User 3'].mean(), inplace = True)

book_ratings

                Author           Book Title  User 1  User 2  User 3  User 4
0      Charles Dickens   Great Expectations     3.2     5.0     2.0     4.0
1       John Steinbeck      Of Mice and Men     NaN     1.3     2.3     3.5
2  William Shakespeare     Romeo and Juliet     2.5     4.0     NaN     4.0
3          H. G. Wells     The Time Machine     NaN     3.8     4.0     5.0
4        Lewis Carroll  Alice in Wonderland     NaN     NaN     NaN     4.2

                Author           Book Title  User 1  User 2  User 3  User 4
0      Charles Dickens   Great Expectations     3.2     5.0     2.0     4.0
1       John Steinbeck      Of Mice and Men     2.9     1.3     2.3     3.5
2  William Shakespeare     Romeo and Juliet     2.5     4.0     2.8     4.0
3          H. G. Wells     The Time Machine     2.9     3.8     4.0     5.0
4        Lewis Carroll  Alice in Wonderland     2.9     3.5     2.8     4.2

## Loading Data into a Pandas DataFrame

In [132]:
# We load Google stock data in a DataFrame
Google_stock = pd.read_csv('~/workspace/udacity-jupyter/GOOG.csv')

# We print some information about Google_stock
print('Google_stock is of type:', type(Google_stock))
print('Google_stock has shape:', Google_stock.shape)

Google_stock is of type: <class 'pandas.core.frame.DataFrame'>
Google_stock has shape: (3313, 7)

In [133]:
Google_stock.head()

         Date  Open  High   Low  Close  Adj Close    Volume
0  2004-08-19  49.7  51.7  47.7   49.8       49.8  44994500
1  2004-08-20  50.2  54.2  49.9   53.8       53.8  23005800
2  2004-08-23  55.0  56.4  54.2   54.3       54.3  18393200
3  2004-08-24  55.3  55.4  51.5   52.1       52.1  15361800
4  2004-08-25  52.1  53.7  51.6   52.7       52.7   9257400

In [134]:
Google_stock.tail()

            Date   Open   High    Low  Close  Adj Close   Volume
3308  2017-10-09  980.0  985.4  976.1  977.0      977.0   891400
3309  2017-10-10  980.0  981.6  966.1  972.6      972.6   968400
3310  2017-10-11  973.7  990.7  972.2  989.2      989.2  1693300
3311  2017-10-12  987.5  994.1  985.0  987.8      987.8  1262400
3312  2017-10-13  992.0  997.2  989.0  989.7      989.7  1157700

In [135]:
Google_stock.isnull().any()

Date         False
Open         False
High         False
Low          False
Close        False
Adj Close    False
Volume       False
dtype: bool

In [137]:
Google_stock['Open'].max()

992.0

In [138]:
Google_stock['Open'].min()

49.274516999999996

In [139]:
Google_stock['Open'].mean()

380.1860917132517